a = int(input())
b = int(input())
c = int(input())

median = 0

if b < a < c or b > a > c:
    median = a

elif a < b < c or a > b > c:
    median = b

elif a < c < b or a > c > b:
    median = c

print(f"{median:.0f}")

# Медиана
# Медианата е средната стойност на група числа, подредени по големина. Тя е числото, което е точно в средата,
# така че 50% от класираните числа са над и 50% - под нея.
#
# Пример
# С цел да се намери медианата на същите 9 числа: 10, 12, 11, 15, 13, 35, 41, 23, 20, първо ги поставяме във възходящ ред,
# т.е. 10, 11, 12, 13, 15, 20, 23, 35, 41 - средният брой е 15: средното число е 15, като 4 числа са под 15 и 4 числа са над 15.
#
# Ако има равен брой числа: 10, 11, 12, 13, 15, 20, 23, 35 - двете в средата (13 и 15) се събират (13 + 15 = 28) и след
# това общото число се разделя на 2 (28/2 = 14), което означава, че медианата в този случай е 14.